Ran Plan for project: `dev` dir: `terragrunt-integration/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
>>>> DEV PLANNING CHANGES <<<<

23:56:52.161 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1
- Unit ./app2


23:56:52.186 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/dfHSk9Vmu6VjQdwNNEIlYb5iiAk/gb9vQw4X6EtgGaLQD3ALmFWJ91E
23:56:52.209 INFO   [modules/random] terraform: Initializing the backend...
23:56:52.209 INFO   [modules/random] terraform: Initializing provider plugins...
23:56:52.209 INFO   [modules/random] terraform: - Finding latest version of hashicorp/random...
23:56:52.210 INFO   terraform: Initializing the backend...
23:56:52.210 INFO   terraform: Initializing provider plugins...
23:56:52.210 INFO   terraform: - Finding latest version of hashicorp/random...
23:56:52.743 INFO   [modules/random] terraform: - Installing hashicorp/random v3.7.2...
23:56:53.458 INFO   [modules/random] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
23:56:53.458 INFO   [modules/random] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:56:53.458 INFO   [modules/random] terraform: selections it made above. Include this file in your version control repository
23:56:53.458 INFO   [modules/random] terraform: so that Terraform can guarantee to make the same selections by default when
23:56:53.458 INFO   [modules/random] terraform: you run "terraform init" in the future.
23:56:53.458 INFO   [modules/random] terraform: Terraform has been successfully initialized!
23:56:53.586 STDOUT [modules/random] terraform: Terraform used the selected providers to generate the following execution
23:56:53.586 STDOUT [modules/random] terraform: plan. Resource actions are indicated with the following symbols:
23:56:53.586 STDOUT [modules/random] terraform:   + create
23:56:53.586 STDOUT [modules/random] terraform: Terraform will perform the following actions:
23:56:53.587 STDOUT [modules/random] terraform:   # random_string.base_bucket_name will be created
23:56:53.587 STDOUT [modules/random] terraform:   + resource "random_string" "base_bucket_name" {
23:56:53.587 STDOUT [modules/random] terraform:       + id          = (known after apply)
23:56:53.587 STDOUT [modules/random] terraform:       + length      = 4
23:56:53.587 STDOUT [modules/random] terraform:       + lower       = true
23:56:53.587 STDOUT [modules/random] terraform:       + min_lower   = 0
23:56:53.587 STDOUT [modules/random] terraform:       + min_numeric = 0
23:56:53.587 STDOUT [modules/random] terraform:       + min_special = 0
23:56:53.587 STDOUT [modules/random] terraform:       + min_upper   = 0
23:56:53.587 STDOUT [modules/random] terraform:       + number      = false
23:56:53.587 STDOUT [modules/random] terraform:       + numeric     = false
23:56:53.587 STDOUT [modules/random] terraform:       + result      = (known after apply)
23:56:53.587 STDOUT [modules/random] terraform:       + special     = false
23:56:53.587 STDOUT [modules/random] terraform:       + upper       = false
23:56:53.587 STDOUT [modules/random] terraform:     }
23:56:53.587 STDOUT [modules/random] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:56:53.587 STDOUT [modules/random] terraform: 
23:56:53.587 STDOUT [modules/random] terraform: Changes to Outputs:
23:56:53.587 STDOUT [modules/random] terraform:   + base_bucket_name = (known after apply)
23:56:53.751 INFO   terraform: - Installing hashicorp/random v3.7.2...
23:56:57.477 INFO   terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
23:56:57.477 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:56:57.477 INFO   terraform: selections it made above. Include this file in your version control repository
23:56:57.477 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
23:56:57.478 INFO   terraform: you run "terraform init" in the future.
23:56:57.478 INFO   terraform: Terraform has been successfully initialized!
23:56:57.619 STDOUT terraform: Terraform used the selected providers to generate the following execution
23:56:57.619 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
23:56:57.619 STDOUT terraform:   + create
23:56:57.619 STDOUT terraform: Terraform will perform the following actions:
23:56:57.619 STDOUT terraform:   # random_string.base_bucket_name will be created
23:56:57.619 STDOUT terraform:   + resource "random_string" "base_bucket_name" {
23:56:57.619 STDOUT terraform:       + id          = (known after apply)
23:56:57.619 STDOUT terraform:       + length      = 4
23:56:57.619 STDOUT terraform:       + lower       = true
23:56:57.619 STDOUT terraform:       + min_lower   = 0
23:56:57.619 STDOUT terraform:       + min_numeric = 0
23:56:57.619 STDOUT terraform:       + min_special = 0
23:56:57.619 STDOUT terraform:       + min_upper   = 0
23:56:57.619 STDOUT terraform:       + number      = false
23:56:57.619 STDOUT terraform:       + numeric     = false
23:56:57.619 STDOUT terraform:       + result      = (known after apply)
23:56:57.619 STDOUT terraform:       + special     = false
23:56:57.619 STDOUT terraform:       + upper       = false
23:56:57.619 STDOUT terraform:     }
23:56:57.619 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:56:57.619 STDOUT terraform: 
23:56:57.619 STDOUT terraform: Changes to Outputs:
23:56:57.619 STDOUT terraform:   + base_bucket_name = (known after apply)
23:56:57.627 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/dfHSk9Vmu6VjQdwNNEIlYb5iiAk/gb9vQw4X6EtgGaLQD3ALmFWJ91E
23:56:57.654 INFO   terraform: Initializing the backend...
23:56:57.665 INFO   terraform: Initializing provider plugins...
23:56:57.666 INFO   terraform: - Reusing previous version of hashicorp/random from the dependency lock file
23:56:57.778 INFO   terraform: - Using previously-installed hashicorp/random v3.7.2
23:56:57.778 INFO   terraform: Terraform has been successfully initialized!
23:56:57.818 WARN   [app2] Config ./commons.hcl is a dependency of ./app2/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
23:56:57.818 WARN   [app1] Config ./commons.hcl is a dependency of ./app1/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
23:56:57.819 INFO   [app2] Downloading Terraform configurations from ./modules/s3-bucket into ./app2/.terragrunt-cache/6_oCQyrtH1BvATjcmKRc0k8X2Tw/6I_o99KCJmHe_VRgNgi-PQC4584
23:56:57.819 INFO   [app1] Downloading Terraform configurations from ./modules/s3-bucket into ./app1/.terragrunt-cache/sAk3VhiCmW8B5Fwh6wgCrxb9MpY/6I_o99KCJmHe_VRgNgi-PQC4584
23:56:57.845 INFO   [app1] terraform: Initializing the backend...
23:56:57.845 INFO   [app1] terraform: Initializing provider plugins...
23:56:57.845 INFO   [app1] terraform: - Finding hashicorp/aws versions matching "~> 5.0"...
23:56:57.847 INFO   [app2] terraform: Initializing the backend...
23:56:57.848 INFO   [app2] terraform: Initializing provider plugins...
23:56:57.848 INFO   [app2] terraform: - Finding hashicorp/aws versions matching "~> 5.0"...
23:56:58.223 INFO   [app1] terraform: - Installing hashicorp/aws v5.100.0...
23:56:58.228 INFO   [app2] terraform: - Installing hashicorp/aws v5.100.0...
23:57:14.497 INFO   [app2] terraform: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
23:57:14.497 INFO   [app2] terraform: Terraform has made some changes to the provider dependency selections recorded
23:57:14.497 INFO   [app2] terraform: in the .terraform.lock.hcl file. Review those changes and commit them to your
23:57:14.497 INFO   [app2] terraform: version control system if they represent changes you intended to make.
23:57:14.497 INFO   [app2] terraform: Terraform has been successfully initialized!
23:57:16.981 STDOUT [app2] terraform: Terraform used the selected providers to generate the following execution
23:57:16.981 STDOUT [app2] terraform: plan. Resource actions are indicated with the following symbols:
23:57:16.981 STDOUT [app2] terraform:   + create
23:57:16.981 STDOUT [app2] terraform: Terraform will perform the following actions:
23:57:16.981 STDOUT [app2] terraform:   # aws_s3_bucket.this will be created
23:57:16.981 STDOUT [app2] terraform:   + resource "aws_s3_bucket" "this" {
23:57:16.981 STDOUT [app2] terraform:       + acceleration_status         = (known after apply)
23:57:16.981 STDOUT [app2] terraform:       + acl                         = "private"
23:57:16.981 STDOUT [app2] terraform:       + arn                         = (known after apply)
23:57:16.981 STDOUT [app2] terraform:       + bucket                      = "app2-new-1-dev-base-name"
23:57:16.982 STDOUT [app2] terraform:       + bucket_domain_name          = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + bucket_prefix               = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + bucket_regional_domain_name = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + force_destroy               = false
23:57:16.982 STDOUT [app2] terraform:       + hosted_zone_id              = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + id                          = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + object_lock_enabled         = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + policy                      = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + region                      = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + request_payer               = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + tags_all                    = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + website_domain              = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + website_endpoint            = (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + cors_rule (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + grant (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + lifecycle_rule (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + logging (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + object_lock_configuration (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + replication_configuration (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + server_side_encryption_configuration (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + versioning (known after apply)
23:57:16.982 STDOUT [app2] terraform:       + website (known after apply)
23:57:16.982 STDOUT [app2] terraform:     }
23:57:16.982 STDOUT [app2] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:57:16.982 STDOUT [app2] terraform: 
23:57:16.982 STDOUT [app2] terraform: Changes to Outputs:
23:57:16.982 STDOUT [app2] terraform:   + bucket_arn = (known after apply)
23:57:16.982 STDOUT [app2] terraform: ╷
23:57:16.982 STDOUT [app2] terraform: │ Warning: Argument is deprecated
23:57:16.982 STDOUT [app2] terraform: │ 
23:57:16.982 STDOUT [app2] terraform: │   with aws_s3_bucket.this,
23:57:16.982 STDOUT [app2] terraform: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
23:57:16.982 STDOUT [app2] terraform: │   17:   acl    = "private"
23:57:16.982 STDOUT [app2] terraform: │ 
23:57:16.982 STDOUT [app2] terraform: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
23:57:16.983 STDOUT [app2] terraform: │ 
23:57:16.983 STDOUT [app2] terraform: │ (and one more similar warning elsewhere)
23:57:16.983 STDOUT [app2] terraform: ╵
23:57:19.413 INFO   [app1] terraform: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
23:57:19.413 INFO   [app1] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:57:19.413 INFO   [app1] terraform: selections it made above. Include this file in your version control repository
23:57:19.413 INFO   [app1] terraform: so that Terraform can guarantee to make the same selections by default when
23:57:19.413 INFO   [app1] terraform: you run "terraform init" in the future.
23:57:19.413 INFO   [app1] terraform: Terraform has been successfully initialized!
23:57:21.780 STDOUT [app1] terraform: Terraform used the selected providers to generate the following execution
23:57:21.780 STDOUT [app1] terraform: plan. Resource actions are indicated with the following symbols:
23:57:21.780 STDOUT [app1] terraform:   + create
23:57:21.780 STDOUT [app1] terraform: Terraform will perform the following actions:
23:57:21.780 STDOUT [app1] terraform:   # aws_s3_bucket.this will be created
23:57:21.780 STDOUT [app1] terraform:   + resource "aws_s3_bucket" "this" {
23:57:21.780 STDOUT [app1] terraform:       + acceleration_status         = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + acl                         = "private"
23:57:21.780 STDOUT [app1] terraform:       + arn                         = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + bucket                      = "app1-new9-dev-base-name"
23:57:21.780 STDOUT [app1] terraform:       + bucket_domain_name          = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + bucket_prefix               = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + bucket_regional_domain_name = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + force_destroy               = false
23:57:21.780 STDOUT [app1] terraform:       + hosted_zone_id              = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + id                          = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + object_lock_enabled         = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + policy                      = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + region                      = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + request_payer               = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + tags_all                    = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + website_domain              = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + website_endpoint            = (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + cors_rule (known after apply)
23:57:21.780 STDOUT [app1] terraform:       + grant (known after apply)
23:57:21.781 STDOUT [app1] terraform:       + lifecycle_rule (known after apply)
23:57:21.781 STDOUT [app1] terraform:       + logging (known after apply)
23:57:21.781 STDOUT [app1] terraform:       + object_lock_configuration (known after apply)
23:57:21.781 STDOUT [app1] terraform:       + replication_configuration (known after apply)
23:57:21.781 STDOUT [app1] terraform:       + server_side_encryption_configuration (known after apply)
23:57:21.781 STDOUT [app1] terraform:       + versioning (known after apply)
23:57:21.781 STDOUT [app1] terraform:       + website (known after apply)
23:57:21.781 STDOUT [app1] terraform:     }
23:57:21.781 STDOUT [app1] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:57:21.781 STDOUT [app1] terraform: 
23:57:21.781 STDOUT [app1] terraform: Changes to Outputs:
23:57:21.781 STDOUT [app1] terraform:   + bucket_arn = (known after apply)
23:57:21.781 STDOUT [app1] terraform: ╷
23:57:21.781 STDOUT [app1] terraform: │ Warning: Argument is deprecated
23:57:21.781 STDOUT [app1] terraform: │ 
23:57:21.781 STDOUT [app1] terraform: │   with aws_s3_bucket.this,
23:57:21.781 STDOUT [app1] terraform: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
23:57:21.781 STDOUT [app1] terraform: │   17:   acl    = "private"
23:57:21.781 STDOUT [app1] terraform: │ 
23:57:21.781 STDOUT [app1] terraform: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
23:57:21.781 STDOUT [app1] terraform: │ 
23:57:21.781 STDOUT [app1] terraform: │ (and one more similar warning elsewhere)
23:57:21.781 STDOUT [app1] terraform: ╵
23:57:21.872 INFO   The runner at . will be processed in the following order for command apply:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1
- Unit ./app2


23:57:22.016 STDOUT terraform: Terraform used the selected providers to generate the following execution
23:57:22.016 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
23:57:22.016 STDOUT terraform:   + create
23:57:22.016 STDOUT terraform: Terraform will perform the following actions:
23:57:22.016 STDOUT terraform:   # random_string.base_bucket_name will be created
23:57:22.016 STDOUT terraform:   + resource "random_string" "base_bucket_name" {
23:57:22.016 STDOUT terraform:       + id          = (known after apply)
23:57:22.016 STDOUT terraform:       + length      = 4
23:57:22.016 STDOUT terraform:       + lower       = true
23:57:22.016 STDOUT terraform:       + min_lower   = 0
23:57:22.016 STDOUT terraform:       + min_numeric = 0
23:57:22.016 STDOUT terraform:       + min_special = 0
23:57:22.016 STDOUT terraform:       + min_upper   = 0
23:57:22.016 STDOUT terraform:       + number      = false
23:57:22.016 STDOUT terraform:       + numeric     = false
23:57:22.016 STDOUT terraform:       + result      = (known after apply)
23:57:22.016 STDOUT terraform:       + special     = false
23:57:22.016 STDOUT terraform:       + upper       = false
23:57:22.016 STDOUT terraform:     }
23:57:22.016 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:57:22.016 STDOUT terraform: 
23:57:22.016 STDOUT terraform: Changes to Outputs:
23:57:22.016 STDOUT terraform:   + base_bucket_name = (known after apply)
23:57:22.018 STDOUT [modules/random] terraform: Terraform used the selected providers to generate the following execution
23:57:22.018 STDOUT [modules/random] terraform: plan. Resource actions are indicated with the following symbols:
23:57:22.018 STDOUT [modules/random] terraform:   + create
23:57:22.018 STDOUT [modules/random] terraform: Terraform will perform the following actions:
23:57:22.018 STDOUT [modules/random] terraform:   # random_string.base_bucket_name will be created
23:57:22.018 STDOUT [modules/random] terraform:   + resource "random_string" "base_bucket_name" {
23:57:22.018 STDOUT [modules/random] terraform:       + id          = (known after apply)
23:57:22.018 STDOUT [modules/random] terraform:       + length      = 4
23:57:22.018 STDOUT [modules/random] terraform:       + lower       = true
23:57:22.018 STDOUT [modules/random] terraform:       + min_lower   = 0
23:57:22.018 STDOUT [modules/random] terraform:       + min_numeric = 0
23:57:22.018 STDOUT [modules/random] terraform:       + min_special = 0
23:57:22.018 STDOUT [modules/random] terraform:       + min_upper   = 0
23:57:22.018 STDOUT [modules/random] terraform:       + number      = false
23:57:22.018 STDOUT [modules/random] terraform:       + numeric     = false
23:57:22.018 STDOUT [modules/random] terraform:       + result      = (known after apply)
23:57:22.018 STDOUT [modules/random] terraform:       + special     = false
23:57:22.018 STDOUT [modules/random] terraform:       + upper       = false
23:57:22.018 STDOUT [modules/random] terraform:     }
23:57:22.018 STDOUT [modules/random] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:57:22.019 STDOUT [modules/random] terraform: 
23:57:22.019 STDOUT [modules/random] terraform: Changes to Outputs:
23:57:22.019 STDOUT [modules/random] terraform:   + base_bucket_name = (known after apply)
23:57:22.044 STDOUT terraform: random_string.base_bucket_name: Creating...
23:57:22.047 STDOUT terraform: random_string.base_bucket_name: Creation complete after 0s [id=lxnx]
23:57:22.048 STDOUT [modules/random] terraform: random_string.base_bucket_name: Creating...
23:57:22.050 STDOUT [modules/random] terraform: random_string.base_bucket_name: Creation complete after 0s [id=eaxh]
23:57:22.056 STDOUT terraform: 
23:57:22.056 STDOUT terraform: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
23:57:22.056 STDOUT terraform: 
23:57:22.056 STDOUT terraform: Outputs:
23:57:22.056 STDOUT terraform: base_bucket_name = "lxnx"
23:57:22.059 STDOUT [modules/random] terraform: 
23:57:22.059 STDOUT [modules/random] terraform: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
23:57:22.059 STDOUT [modules/random] terraform: 
23:57:22.059 STDOUT [modules/random] terraform: Outputs:
23:57:22.059 STDOUT [modules/random] terraform: base_bucket_name = "eaxh"
Are you sure you want to run 'terragrunt apply' in each unit of the run queue displayed above? (y/n) 23:57:22.068 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/dfHSk9Vmu6VjQdwNNEIlYb5iiAk/gb9vQw4X6EtgGaLQD3ALmFWJ91E
23:57:22.092 INFO   terraform: Initializing the backend...
23:57:22.103 INFO   terraform: Initializing provider plugins...
23:57:22.103 INFO   terraform: - Reusing previous version of hashicorp/random from the dependency lock file
23:57:22.217 INFO   terraform: - Using previously-installed hashicorp/random v3.7.2
23:57:22.217 INFO   terraform: Terraform has been successfully initialized!
23:57:24.797 STDOUT [app2] terraform: Terraform used the selected providers to generate the following execution
23:57:24.797 STDOUT [app2] terraform: plan. Resource actions are indicated with the following symbols:
23:57:24.797 STDOUT [app2] terraform:   + create
23:57:24.797 STDOUT [app2] terraform: Terraform will perform the following actions:
23:57:24.797 STDOUT [app2] terraform:   # aws_s3_bucket.this will be created
23:57:24.797 STDOUT [app2] terraform:   + resource "aws_s3_bucket" "this" {
23:57:24.797 STDOUT [app2] terraform:       + acceleration_status         = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + acl                         = "private"
23:57:24.798 STDOUT [app2] terraform:       + arn                         = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + bucket                      = "app2-new-1-dev-eaxh"
23:57:24.798 STDOUT [app2] terraform:       + bucket_domain_name          = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + bucket_prefix               = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + bucket_regional_domain_name = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + force_destroy               = false
23:57:24.798 STDOUT [app2] terraform:       + hosted_zone_id              = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + id                          = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + object_lock_enabled         = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + policy                      = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + region                      = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + request_payer               = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + tags_all                    = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + website_domain              = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + website_endpoint            = (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + cors_rule (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + grant (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + lifecycle_rule (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + logging (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + object_lock_configuration (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + replication_configuration (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + server_side_encryption_configuration (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + versioning (known after apply)
23:57:24.798 STDOUT [app2] terraform:       + website (known after apply)
23:57:24.798 STDOUT [app2] terraform:     }
23:57:24.798 STDOUT [app2] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:57:24.798 STDOUT [app2] terraform: 
23:57:24.798 STDOUT [app2] terraform: Changes to Outputs:
23:57:24.798 STDOUT [app2] terraform:   + bucket_arn = (known after apply)
23:57:24.799 STDOUT [app1] terraform: Terraform used the selected providers to generate the following execution
23:57:24.799 STDOUT [app1] terraform: plan. Resource actions are indicated with the following symbols:
23:57:24.799 STDOUT [app1] terraform:   + create
23:57:24.799 STDOUT [app1] terraform: Terraform will perform the following actions:
23:57:24.799 STDOUT [app1] terraform:   # aws_s3_bucket.this will be created
23:57:24.799 STDOUT [app1] terraform:   + resource "aws_s3_bucket" "this" {
23:57:24.799 STDOUT [app1] terraform:       + acceleration_status         = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + acl                         = "private"
23:57:24.800 STDOUT [app1] terraform:       + arn                         = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + bucket                      = "app1-new9-dev-eaxh"
23:57:24.800 STDOUT [app1] terraform:       + bucket_domain_name          = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + bucket_prefix               = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + bucket_regional_domain_name = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + force_destroy               = false
23:57:24.800 STDOUT [app1] terraform:       + hosted_zone_id              = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + id                          = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + object_lock_enabled         = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + policy                      = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + region                      = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + request_payer               = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + tags_all                    = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + website_domain              = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + website_endpoint            = (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + cors_rule (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + grant (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + lifecycle_rule (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + logging (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + object_lock_configuration (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + replication_configuration (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + server_side_encryption_configuration (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + versioning (known after apply)
23:57:24.800 STDOUT [app1] terraform:       + website (known after apply)
23:57:24.800 STDOUT [app1] terraform:     }
23:57:24.800 STDOUT [app1] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:57:24.800 STDOUT [app1] terraform: 
23:57:24.800 STDOUT [app1] terraform: Changes to Outputs:
23:57:24.800 STDOUT [app1] terraform:   + bucket_arn = (known after apply)
23:57:25.582 STDOUT [app1] terraform: aws_s3_bucket.this: Creating...
23:57:25.585 STDOUT [app2] terraform: aws_s3_bucket.this: Creating...
23:57:28.667 STDOUT [app2] terraform: aws_s3_bucket.this: Creation complete after 3s [id=app2-new-1-dev-eaxh]
23:57:28.689 STDOUT [app2] terraform: ╷
23:57:28.689 STDOUT [app2] terraform: │ Warning: Argument is deprecated
23:57:28.689 STDOUT [app2] terraform: │ 
23:57:28.689 STDOUT [app2] terraform: │   with aws_s3_bucket.this,
23:57:28.689 STDOUT [app2] terraform: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
23:57:28.689 STDOUT [app2] terraform: │   17:   acl    = "private"
23:57:28.689 STDOUT [app2] terraform: │ 
23:57:28.689 STDOUT [app2] terraform: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
23:57:28.689 STDOUT [app2] terraform: │ 
23:57:28.689 STDOUT [app2] terraform: │ (and 2 more similar warnings elsewhere)
23:57:28.689 STDOUT [app2] terraform: ╵
23:57:28.689 STDOUT [app2] terraform: 
23:57:28.689 STDOUT [app2] terraform: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
23:57:28.689 STDOUT [app2] terraform: 
23:57:28.689 STDOUT [app2] terraform: Outputs:
23:57:28.689 STDOUT [app2] terraform: bucket_arn = "arn:aws:s3:::app2-new-1-dev-eaxh"
23:57:28.820 STDOUT [app1] terraform: aws_s3_bucket.this: Creation complete after 3s [id=app1-new9-dev-eaxh]
23:57:28.835 STDOUT [app1] terraform: ╷
23:57:28.835 STDOUT [app1] terraform: │ Warning: Argument is deprecated
23:57:28.835 STDOUT [app1] terraform: │ 
23:57:28.835 STDOUT [app1] terraform: │   with aws_s3_bucket.this,
23:57:28.835 STDOUT [app1] terraform: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
23:57:28.835 STDOUT [app1] terraform: │   17:   acl    = "private"
23:57:28.836 STDOUT [app1] terraform: │ 
23:57:28.836 STDOUT [app1] terraform: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
23:57:28.836 STDOUT [app1] terraform: │ 
23:57:28.836 STDOUT [app1] terraform: │ (and 2 more similar warnings elsewhere)
23:57:28.836 STDOUT [app1] terraform: ╵
23:57:28.836 STDOUT [app1] terraform: 
23:57:28.836 STDOUT [app1] terraform: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
23:57:28.836 STDOUT [app1] terraform: 
23:57:28.836 STDOUT [app1] terraform: Outputs:
23:57:28.836 STDOUT [app1] terraform: bucket_arn = "arn:aws:s3:::app1-new9-dev-eaxh"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://890ca2a7b7e7.ngrok-free.app/lock?id=jefersonlemos%252Fatlantis-playground%252Fterragrunt-integration%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p dev
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```